app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT * FROM `albums`

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)

  def edit
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)

  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO `albums` (`artist`, `created_at`, `title`, `updated_at`, `genre`, `release_date`) VALUES('bite', '2010-05-22 16:21:20', 'urukundo', '2010-05-22 16:21:20', 'r&B', '2009-06-12 06:20:00')

  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 2)
UPDATE `albums` SET `updated_at` = '2010-05-29 14:08:17', `artist` = 'jenzzo' WHERE `id` = 2