app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-05-29 21:10:20', '980810dcc9a83cb7c7a6638e205acc2c38588b93f3814a8f12aa274693c0267baf3208db67650e0f4314477a36c1c306770e4d52637d60ecd92f93406c588350', '2010-05-29 21:10:20', 'jenzzo', 'tuMhRrPm75xp9zMVBj9D', 'a773e23dd722e2d3a42833333666eb68df76d66812313e61870ef7067419e4a813f31124f75c6e3c0e7f3a7e7339954f5eb55be3e956ce51ac10d42e86d6bd03', 'jenzzly@gmail.com')
---
  def create
    @user = User.new(params[:user])
 	if @user.save

UPDATE `users` SET `updated_at` = '2010-05-29 21:51:05', `crypted_password` = '09ca93e157c3af8337fbd231c3975e4ad9c76029bb21ccf3c0b23c59fbf181a70828390566ec8bf76ae9fbc3207d621953ca2630047cae5ca0066cdbc855227e', `password_salt` = 'tJQHIYTe-sbHV2_RVamv', `persistence_token` = 'ba4c5d0b23bb92f56aadd3c1da6f8c9df23b14f60f55064babfa3f58699724613e386e56f26d66ef9a8a6b08a48adf07090927cdbb88222ea2d9a029830e697f' WHERE `id` = 1
---
  def update
  @user = current_user
  if @user.update_attributes(params[:user])